---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IndexPoint
source: html/cd53f076-2011-ce3a-f92e-3b384f21b8ec.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexPoint

A point primitive consisting of one index.

## Syntax (C#)
```csharp
public class IndexPoint : IndexPrimitive
```